Repository: JCID/directadmin-evolution-skin-dutch-translation
Catalog: login-*.po
Languages: nl

source: ← Back to the login page
nl: ← Terug naar de loginpagina

source: Authenticate
nl: Authoriseren

source: Code from E-mail
nl: Bevestigingscode van e-mail

source: Computer or server time out of sync by %{ hours } hours.
nl: Computer- of servertijd loopt %{ hours } uur voor/achter.

source: Enter your Username and a confirmation link will be sent to your email account.
nl: Vul uw gebruikersnaam in en een bevestigingslink zal worden verstuurd naar uw e-mailadres.

source: Forgot Password?
nl: Wachtwoord vergeten?

source: Hmm, login details do not seem to be correct. Please try again.
nl: Hmm, logingegevens lijken niet correct te zijn. Probeer het opnieuw.

source: Language
nl: Taal

source: Log In using your username and code from E-mail
nl: Log in met uw gebruikersnaam en bevestigingscode die u per e-mail heeft ontvangen

source: Manage your domains, databases & other server info.
nl: Beheer uw domeinen, databases & andere serverinformatie.

source: Password
nl: Wachtwoord

source: Please enter username
nl: Voer a.u.b. uw gebruikersnaam in

source: Request New Password
nl: Nieuw wachtwoord aanvragen

source: Send me a Link
nl: Stuur mij een link

source: Sign in to Account
nl: Aanmelden bij account

source: Submit Answer
nl: Verstuur antwoord

source: Trust this device for %{ days } days
nl: Vertrouw dit apparaat voor %{ days } dagen

source: Two Step Authentication
nl: Tweestaps authenticatie

source: Username
nl: Gebruikersnaam
